#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖``
#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
random_password.flyte_db_password: Refreshing state... [id=none]
module.flyte_gcs_backend.random_id.bucket_suffix: Refreshing state... [id=FsY]
module.gcs_api_extract.random_id.bucket_suffix: Refreshing state... [id=i_k]
module.flyte_gcs_backend.google_storage_bucket.buckets["flyte-storage-backend"]: Refreshing state... [id=pricing-aggregator-us-east1-flyte-storage-backend]
google_project_iam_custom_role.flyte_backend_role: Refreshing state... [id=projects/exemplary-tide-379122/roles/flyteBackendRole]
module.gcs_api_extract.google_storage_bucket.buckets["spotify-web-api-extracts"]: Refreshing state... [id=pricing-aggregator-us-east1-spotify-web-api-extracts]
google_project_service.compute_api: Refreshing state... [id=exemplary-tide-379122/compute.googleapis.com]
google_project_service.cloud_sql_api: Refreshing state... [id=exemplary-tide-379122/sqladmin.googleapis.com]
data.google_client_config.default: Reading...
google_project_service.secret_mgr_api: Refreshing state... [id=exemplary-tide-379122/secretmanager.googleapis.com]
google_service_account.user_code_service_account: Refreshing state... [id=projects/exemplary-tide-379122/serviceAccounts/user-code-sa@exemplary-tide-379122.iam.gserviceaccount.com]
google_container_node_pool.flyte_node_pool: Refreshing state... [id=projects/exemplary-tide-379122/locations/us-east1-b/clusters/flyte-binary-cluster/nodePools/flyte-np]
google_container_cluster.flyte_binary_cluster: Refreshing state... [id=projects/exemplary-tide-379122/locations/us-east1-b/clusters/flyte-binary-cluster]
data.google_client_config.default: Read complete after 1s [id=projects/"exemplary-tide-379122"/regions/"us-east1"/zones/<null>]
google_project_service.container_api: Refreshing state... [id=exemplary-tide-379122/container.googleapis.com]
google_service_account.flyte_service_account: Refreshing state... [id=projects/exemplary-tide-379122/serviceAccounts/flyte-sa@exemplary-tide-379122.iam.gserviceaccount.com]
google_project_service.composer_api: Refreshing state... [id=exemplary-tide-379122/composer.googleapis.com]
google_project_iam_member.user_code_role_member: Refreshing state... [id=exemplary-tide-379122/roles/editor/serviceAccount:user-code-sa@exemplary-tide-379122.iam.gserviceaccount.com]
module.flyte_gcs_backend.google_storage_bucket_iam_binding.admins["flyte-storage-backend"]: Refreshing state... [id=b/pricing-aggregator-us-east1-flyte-storage-backend/roles/storage.objectAdmin]
google_project_iam_binding.flyte_backend_role_binding: Refreshing state... [id=exemplary-tide-379122/projects/exemplary-tide-379122/roles/flyteBackendRole]
module.gcs_api_extract.google_storage_bucket_iam_binding.admins["spotify-web-api-extracts"]: Refreshing state... [id=b/pricing-aggregator-us-east1-spotify-web-api-extracts/roles/storage.objectAdmin]
google_sql_database_instance.flyte_db_backend: Refreshing state... [id=flyte-db-backend]
google_sql_user.flyte_db_user: Refreshing state... [id=postgres//flyte-db-backend]
helm_release.flyte_single_cluster: Refreshing state... [id=flyte-test-setup]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform planned the following actions, but then encountered a problem:

  # google_container_cluster.flyte_binary_cluster will be destroyed
  # (because google_container_cluster.flyte_binary_cluster is not in configuration)
  - resource "google_container_cluster" "flyte_binary_cluster" {
      - cluster_ipv4_cidr           = "10.100.0.0/14" -> null
      - enable_autopilot            = false -> null
      - enable_binary_authorization = false -> null
      - enable_intranode_visibility = false -> null
      - enable_kubernetes_alpha     = false -> null
      - enable_l4_ilb_subsetting    = false -> null
      - enable_legacy_abac          = false -> null
      - enable_shielded_nodes       = true -> null
      - enable_tpu                  = false -> null
      - endpoint                    = "34.73.251.34" -> null
      - id                          = "projects/exemplary-tide-379122/locations/us-east1-b/clusters/flyte-binary-cluster" -> null
      - initial_node_count          = 2 -> null
      - label_fingerprint           = "a9dc16a7" -> null
      - location                    = "us-east1-b" -> null
      - logging_service             = "logging.googleapis.com/kubernetes" -> null
      - master_version              = "1.26.5-gke.1200" -> null
      - monitoring_service          = "monitoring.googleapis.com/kubernetes" -> null
      - name                        = "flyte-binary-cluster" -> null
      - network                     = "projects/exemplary-tide-379122/global/networks/default" -> null
      - networking_mode             = "ROUTES" -> null
      - node_locations              = [] -> null
      - node_version                = "1.26.5-gke.1200" -> null
      - project                     = "exemplary-tide-379122" -> null
      - remove_default_node_pool    = true -> null
      - resource_labels             = {} -> null
      - self_link                   = "https://container.googleapis.com/v1/projects/exemplary-tide-379122/zones/us-east1-b/clusters/flyte-binary-cluster" -> null
      - services_ipv4_cidr          = "10.103.240.0/20" -> null
      - subnetwork                  = "projects/exemplary-tide-379122/regions/us-east1/subnetworks/default" -> null

      - addons_config {
          - gce_persistent_disk_csi_driver_config {
              - enabled = true -> null
            }
          - network_policy_config {
              - disabled = true -> null
            }
        }

      - binary_authorization {
          - enabled = false -> null
        }

      - cluster_autoscaling {
          - enabled = false -> null
        }

      - database_encryption {
          - state = "DECRYPTED" -> null
        }

      - default_snat_status {
          - disabled = false -> null
        }

      - logging_config {
          - enable_components = [
              - "SYSTEM_COMPONENTS",
              - "WORKLOADS",
            ] -> null
        }

      - master_auth {
          - cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUVMVENDQXBXZ0F3SUJBZ0lSQVBmY1p1NTNEM0xQTjlXVWV2TzREMmN3RFFZSktvWklodmNOQVFFTEJRQXcKTHpFdE1Dc0dBMVVFQXhNa09EQTBabVZrWkdVdFpEaGxaaTAwWTJVd0xXSmtaRGd0WlRZeE4yTmhNekU1WlRSaQpNQ0FYRFRJek1EY3lNVEl3TVRReU1Gb1lEekl3TlRNd056RXpNakV4TkRJd1dqQXZNUzB3S3dZRFZRUURFeVE0Ck1EUm1aV1JrWlMxa09HVm1MVFJqWlRBdFltUmtPQzFsTmpFM1kyRXpNVGxsTkdJd2dnR2lNQTBHQ1NxR1NJYjMKRFFFQkFRVUFBNElCandBd2dnR0tBb0lCZ1FDNTY3Y2RGQVFqb2FvSXNPYTA2L29ycFZMTWNBcXhtdlRmd1N4Ugo4WitlZ3pUQVVaa2xPSzVXUllpVFlwRk9Ienk0WXVTcExPT2haNFpHVUxyZFNoUXU2MFFkV2JyTWduMmZBOGxrCjliZVRicWJkd1pSSm5jUURwZTRuKy93dDFmZFF4c2pmZ0VoWjgvc2F0Q1BzZVhOVGdNazRKWjh3VXpON3pETTYKdUxsSEQyMmIyejBGRkM5Y3FMS2JZcHMwYVlOVGhyRGtlOTE4djBSYVh1NTkycVZqa0FaZ1Jjd2pIUWhhUFliagpMaVgwTHR6SklnSkN6ZDhxZmN2dnR5N0JkSTF6TnNGblZzTFMyQjBUdHFLY3lzUW9uT0p1UVpjalg2c0JSNzdKClcrNEt3RkRVUDJqWmJhejJQYTJlQmpUY3VUS0dnd0hRdlQ1dGxrS0gzU2NKaDdnckdURVVNK0k3L3hBL2tzOG0KRkRzZkVCRXlEQWUzKzBoRlo2WGlTOTREL01NRmFYc2kzSUkyZVRvVmRBUlJ2R2ltUEQ4TXNBb25rNi9vNlN6QQpZdm94RU16UmpqbkNEbGJ1Z2xjTThQb0xQRkc2OXZwaUZ0d2ozakxVYmhGeno4VWM5cUtwSkpINGFVM3k1b2daCkxwMTdhMjdJdEtXV3FRUTlOSEpvS1hnWVYrY0NBd0VBQWFOQ01FQXdEZ1lEVlIwUEFRSC9CQVFEQWdJRU1BOEcKQTFVZEV3RUIvd1FGTUFNQkFmOHdIUVlEVlIwT0JCWUVGQU9lazVWSWNRYUxpZno4NkxhYXVPR2tyck5zTUEwRwpDU3FHU0liM0RRRUJDd1VBQTRJQmdRQktmL0xXck9MUExsbzAzV095YTRDQkxUSEpxTTlpQ3lxNWZ0bzVrTUZJCnlBaXJ1cGVuM01hRDRsTHBDSXZCVzFEaHQ2RCs2UXdCQ25IclE1SzVFcW5YSDRCRUFEY0g0L0l5Ym9ZS2lQdzIKL1lLRHlwTHA0SUwzY2gvbXVDUjRKYi9WejN0a2hkR1k5eDlmQ213RmNrb1hPUFdhb3hCTXIxVFoybXJqdUdjeQo5RjhzR25JWnZKa3ZlWXJSVnU0Z1liTWVPQzlGMUEzMUdUVnRiTFZvN3ZVMTJFVUpmanFXdi9FZWtxRjV6emw2CjNKNkZsc3ZlUHp1OFVVbDJuL1YxTW52bmdnUXRZT2hobFFiYWE3VGY1eWtpdkZ2ejBVV2prZ2pYNXk3dUw4d2EKdWE4VVg5OEFpQ3Ezajg4R1J6V09ET09UZWdIZERZb1J1VDFwNlRmcXo2M25NYnNGRjJtWCt2c3ZBYU5SQ25IMgpEaXlmUGRyTm0za05PKzdvelVjM2g4YjdmbmJiakprS1VoU2lTYm41SXpuOFc2UVdZYmZBQ3FpZUlQbG82VE9zClU2dHRDa256bGJXdkJFN2d0cERUYTBaWUtyWmk4VldWUDhwb3ZiTHRXZXBZdzIvRG5UMVNtMkVvbHBIWDdxcnQKVDAraU9YbUVRWXlSdHBsNUVmd3pkcTQ9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> null

          - client_certificate_config {
              - issue_client_certificate = false -> null
            }
        }

      - monitoring_config {
          - enable_components = [
              - "SYSTEM_COMPONENTS",
            ] -> null
        }

      - network_policy {
          - enabled  = false -> null
          - provider = "PROVIDER_UNSPECIFIED" -> null
        }

      - node_pool_defaults {
          - node_config_defaults {
              - logging_variant = "DEFAULT" -> null
            }
        }

      - notification_config {
          - pubsub {
              - enabled = false -> null
            }
        }

      - private_cluster_config {
          - enable_private_endpoint = false -> null
          - enable_private_nodes    = false -> null
          - private_endpoint        = "10.142.15.214" -> null
          - public_endpoint         = "34.73.251.34" -> null

          - master_global_access_config {
              - enabled = false -> null
            }
        }

      - release_channel {
          - channel = "REGULAR" -> null
        }

      - security_posture_config {
          - mode               = "MODE_UNSPECIFIED" -> null
          - vulnerability_mode = "VULNERABILITY_MODE_UNSPECIFIED" -> null
        }

      - service_external_ips_config {
          - enabled = false -> null
        }
    }

  # google_container_cluster.flyte_cluster will be created
  + resource "google_container_cluster" "flyte_cluster" {
      + cluster_ipv4_cidr           = (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = (known after apply)
      + enable_binary_authorization = false
      + enable_intranode_visibility = (known after apply)
      + enable_kubernetes_alpha     = false
      + enable_l4_ilb_subsetting    = false
      + enable_legacy_abac          = false
      + enable_shielded_nodes       = true
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + initial_node_count          = 2
      + label_fingerprint           = (known after apply)
      + location                    = "us-east1-b"
      + logging_service             = (known after apply)
      + master_version              = (known after apply)
      + monitoring_service          = (known after apply)
      + name                        = "flyte-cluster"
      + network                     = "default"
      + networking_mode             = (known after apply)
      + node_locations              = (known after apply)
      + node_version                = (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      + project                     = (known after apply)
      + remove_default_node_pool    = true
      + self_link                   = (known after apply)
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = (known after apply)
      + tpu_ipv4_cidr_block         = (known after apply)

      + master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          + cluster_ca_certificate = (known after apply)

          + client_certificate_config {
              + issue_client_certificate = false
            }
        }

      + node_config {
          + disk_size_gb      = 10
          + disk_type         = "pd-balanced"
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + logging_variant   = "DEFAULT"
          + machine_type      = (known after apply)
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = (known after apply)
          + preemptible       = false
          + service_account   = (known after apply)
          + spot              = false
          + taint             = (known after apply)

          + ephemeral_storage_local_ssd_config {
              + local_ssd_count = 0
            }
        }

      + release_channel {
          + channel = "REGULAR"
        }
    }

  # google_container_node_pool.flyte_binary_node_pool will be created
  + resource "google_container_node_pool" "flyte_binary_node_pool" {
      + cluster                     = "flyte-cluster"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "us-east1-b"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "flyte-binary-np"
      + name_prefix                 = (known after apply)
      + node_count                  = 2
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = (known after apply)
      + version                     = (known after apply)

      + autoscaling {
          + location_policy = (known after apply)
          + max_node_count  = 4
          + min_node_count  = 2
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + logging_variant   = "DEFAULT"
          + machine_type      = "e2-medium"
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible       = true
          + service_account   = "flyte-sa@exemplary-tide-379122.iam.gserviceaccount.com"
          + spot              = false
          + taint             = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.

```

</details>

*Pushed by: @kevinsunny1996, Action: `pull_request`*